Runback Final/Final_M2_Cav2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          128;
        startFace       269184;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       269312;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          192;
        startFace       269440;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          960;
        startFace       269632;
    }
    obstacle
    {
        type            patch;
        nFaces          896;
        startFace       270592;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          135168;
        startFace       271488;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          135168;
        startFace       406656;
    }
)

// ************************************************************************* //
