Runback Final/Final_M2_Cav2/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points
    entryWall 
    {
        type    lineCell;
        axis    xyz;
        start   (-1.0 1e-5 0);
        end     (1.0 1e-5 0);
    }
    stepFace
    {
        type    lineCell;
        axis    xyz;
        start   (0.5 0 0);
        end     (0.5 0.3 0);
    }
    stepHorizontal
    {
        type    lineCell;
        axis    xyz;
        start   (0.5 0.2 0);
        end     (4 0.2 0);
    }
    topWall
    {
        type    lineCell;
        axis    xyz;
        start   (-1 1 0);
        end     (4 1 0);
    }
);

fields          ( p U T);


// ************************************************************************* //
